config.org
#+title:     Doom Emacs Literate Config
#+author:    Jay L. Colbert
#+email:     jaylcolbert@gmail.com

* Table of Contents :toc_3:
- [[#introduction][Introduction]]
  - [[#why-emacs][Why Emacs?]]
  - [[#using-this-config][Using this config]]
  - [[#current-issues][Current issues]]
  - [[#possible-future-features][Possible future features]]
- [[#rudimentary-configuration][Rudimentary Configuration]]
  - [[#personal-information][Personal information]]
  - [[#better-defaults][Better defaults]]
    - [[#simple-settings][Simple settings]]
    - [[#frame-sizing][Frame sizing]]
- [[#doom-configuration][Doom configuration]]
  - [[#modules][Modules]]
    - [[#completion][Completion]]
    - [[#ui][UI]]
    - [[#editor][Editor]]
    - [[#tools][Tools]]
    - [[#languages][Languages]]
  - [[#visual-settings][Visual settings]]
    - [[#font-face][Font face]]
    - [[#theme][Theme]]
    - [[#line-numbers][Line numbers]]
- [[#packages][Packages]]
  - [[#consult-org-roam][Consult-org-roam]]
  - [[#doct][Doct]]
  - [[#hydra-posframe][Hydra-posframe]]
  - [[#info-colors][Info-colors]]
  - [[#major-mode-hydra][Major-mode-hydra]]
  - [[#org-ol-tree][Org-ol-tree]]
  - [[#org-roam-desktop][Org-roam-desktop]]
  - [[#org-transclusion][Org-transclusion]]
  - [[#rotate][Rotate]]
  - [[#zetteldesk][Zetteldesk]]
- [[#documents][Documents]]
  - [[#configel][=config.el=]]
  - [[#packagesel][=packages.el=]]
  - [[#autoloads][Autoloads]]
    - [[#hydrasel][=hydras.el=]]
    - [[#iconsel][=icons.el=]]
    - [[#org-captureel][=org-capture.el=]]
    - [[#org-roamel][=org-roam.el=]]
    - [[#posframeel][=posframe.el=]]

* Introduction
** Why Emacs?
** Using this config
If you want your setup exactly like mine, here are the necessary prerequisites.
All of these commands are run on the command line.

*Have a Mac*

   I'm on the M1 chip now.

*Install Homebrew*

#+begin_src sh :tangle no
/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
#+end_src

*Install Emacs Plus*

   I am on Emacs 28, built with native compilation.
   You don't have to do native comp, but it's supposed to be faster I think.
   I also added a different icon, but that's not necessary.
#+begin_src sh :tangle no
brew tap d12frosted/emacs-plus
brew install emacs-plus@28 --with-native-comp --with-nobu417-big-sur-icon
ln -s /opt/homebrew/Cellar/emacs-plus@27/27.2/Emacs.app /Applications
#+end_src

*Install Doom*

   First we need some dependencies:
#+begin_src sh :tangle no
# required dependencies
brew install git ripgrep
# optional dependencies
brew install coreutils fd
# Installs clang
xcode-select --install
#+end_src

  Now we can install Doom.
  This will take forever because of the native comp.
#+begin_src sh :tangle no
git clone --depth 1 https://github.com/hlissner/doom-emacs ~/.config/emacs
~/.config/emacs/bin/doom install
#+end_src

  I put my configs in =~/.config= as much as possible.
  The documentation puts it in a =~/.emacs.d= folder.

  Then I add it to my ~PATH~.
  I use the fish shell, so my way of doing this will be different.
  Change as necessary for your shell.
#+begin_src sh :tangle no
fish_add_path $HOME/.config/emacs/bin
#+end_src

  Now we can use the ~doom~ utility.
  I recommend running ~doom sync~ first.

  My standard workflow after installing/removing packages or changing =init.el= is:
#+begin_src sh :tangle no
doom sync -up
doom purge -g
doom doctor
#+end_src

For the rest of my setup, please see my dotfiles.

** Current issues
** Possible future features
* Rudimentary Configuration
** Personal information
Enter in the info we want when things auto-fill names/emails.
I think this also involves GPG, but I'm not sure.
#+begin_src elisp :tangle no :noweb-ref personal-info
(setq user-full-name    "Jay L. Colbert"
      user-mail-address "jaylcolbert@gmail.com")
#+end_src

** Better defaults
*** Simple settings
I have ADHD, so I need to see the time and battery in the program.
Otherwise, I won't remember to look up at the time in my Mac menu bar.
#+begin_src elisp :tangle no :noweb-ref simple-settings
(display-time-mode 1)
(display-battery-mode 1)
#+end_src

I don't want to see =.DS_Store= files when I'm searching.
#+begin_src elisp :tangle no :noweb-ref simple-settings
(add-to-list 'completion-ignored-extensions ".DS_Store")
#+end_src

*** Frame sizing
I use =emacs-plus=.
It's great, but there's one things that =emacs-mac= did that I miss:
centering the initial frame and sizing it in a way I really liked.
Changing my settings to replicate that is takes a few steps.
According to the =initial-frame-alist= documentation:
#+begin_quote
You can specify geometry-related options for just the initial
frame by setting this variable in your init file; however, they
won't take effect until Emacs reads your init file, which happens
after creating the initial frame.  If you want the initial frame
to have the proper geometry as soon as it appears, you need to
use this three-step process:
+ Specify X resources to give the geometry you want.
+ Set default-frame-alist to override these options so that they
  don't affect subsequent frames.
+ Set initial-frame-alist in a way that matches the X resources,
  to override what you put in default-frame-alist.
#+end_quote

So let's do that.

Newer Macs don't use X to manage windows.
They use Cocoa (which has NSWindow).
Luckily, specifying this geometry is the same process.
It's been a little fussy, but it's good enough for me right now.
We set the width and height in characters and the position of the top left corner in pixels.
(So you need to figure out the pixel position.
I have a program that will center windows on my screen.
I did that, and then I went to take a screenshot but only for a specific section.
It gives you a little crosshair with the pixel position.
I put the crosshair there and used those pixel coordinates.)
#+begin_src sh :tangle no
defaults write org.gnu.Emacs Width 80
defaults write org.gnu.Emacs Height 40
defaults write org.gnu.Emacs Top 181
defaults write org.gnu.Emacs Left 422
#+end_src

Next, we can set =default-frame-alist= to override our geometry settings.
I don't care about the position of default frames.
I rarely use more than one frame, so the geometry defaults and the initial frame settings usually do the trick for me.
I also don't mind the size of the default frame when I do create additional ones.

Finally, it tells us to set =initial-frame-alist= to match our geometry settings.
The width and height parameters are set the same, but I think top and left are percentage/fractional.
These settings replicate my defaults above:
#+begin_src elisp :tangle no :noweb-ref frame-sizing
(setq initial-frame-alist
      '((top . 0.5) (left . 0.5) (width . 80) (height . 40)))
#+end_src

* Doom configuration
** Modules
This is where I configure the modules I've activated in =init.el=.
Other packages are configured elsewhere.
*** Completion
**** Company
I hate when the completion suggestions pop up super fast.
This gives a bit of a delay.
#+begin_src elisp :tangle no :noweb-ref company
(after! company
  (setq company-idle-delay 0.5))
#+end_src

*** UI
**** Deft
I have Deft enabled, but I need to do my config for it.
I don't really use it that much, but it's something that I know is already installed or something by another package, so I like to at least have the Doom configuration turned on.

**** Doom
These are the Doom settings meant to be configured outside of module configuration.
The first two just give the buffer a nicer looking name when there's nothing in it.
The third is from Tecosaur.
It puts some cool icons that indicate if something is an Org Roam file or a project file.
It also lets you know if you've saved your changes via some neat circles.
Finally, we have another delay setting.
This time, it speeds up the Which Key menu.
This variable says to set it before Which Key loads, which is why I'm not configuring it as its own module.
#+begin_src elisp :tangle no :noweb-ref doom
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom"
      frame-title-format
      '(""
        (:eval
         (if (s-contains-p org-roam-directory (or buffer-file-name ""))
             (replace-regexp-in-string
              ".*/[0-9]*-?" "☰ "
              (subst-char-in-string ?_ ?  buffer-file-name))
           "%b"))
        (:eval
         (let ((project-name (projectile-project-name)))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name)))))
      which-key-idle-delay 0.5)
#+end_src

