config.org
** Major-mode-hydra
Major-mode-hydra provides the pretty-hydra package.
I had never really used hydras before, but the Zetteldesk package has suggested hydra keybindings and uses pretty-hydra.
#+begin_src elisp :tangle no :noweb-ref p-major-mode-hydra
(package! major-mode-hydra)
#+end_src

This function is from the maintainer of major-mode-hydra.
Basically, it shows the documentation for whatever item under the cursor in elisp mode.
#+begin_src elisp :tangle no :noweb-ref describe-foo-at-point
(defun describe-foo-at-point ()
  "Show the documentation of the Elisp function and variable near point.
This checks in turn:
-- for a function name where point is
-- for a variable name where point is
-- for a surrounding function call"
  (interactive)
  (let (sym)
    ;; sigh, function-at-point is too clever.  we want only the first half.
    (cond ((setq sym (ignore-errors
                       (with-syntax-table emacs-lisp-mode-syntax-table
                         (save-excursion
                           (or (not (zerop (skip-syntax-backward "_w")))
                               (eq (char-syntax (char-after (point))) ?w)
                               (eq (char-syntax (char-after (point))) ?_)
                               (forward-sexp -1))
                           (skip-chars-forward "`'")
                           (let ((obj (read (current-buffer))))
                             (and (symbolp obj) (fboundp obj) obj))))))
           (describe-function sym))
          ((setq sym (variable-at-point)) (describe-variable sym))
          ;; now let it operate fully -- i.e. also check the
          ;; surrounding sexp for a function call.
          ((setq sym (function-at-point)) (describe-function sym)))))
#+end_src

This generates the title of the hydra and an icon based on the major mode.
#+begin_src elisp :tangle no :noweb-ref jc-major-mode-hydra-title-generator
(defun jc-major-mode-hydra-title-generator (_)
  `(with-mode-icon major-mode
                   (propertize (s-concat (format-mode-line mode-name) " Commands")
                               'face '(:weight bold :height 1.1))
                   1.1))
#+end_src

And here is where we configure it.
I have a quit key that will cover all hydras made with this package.
And I also took the example elisp mode hydra.
#+begin_src elisp :tangle no :noweb-ref major-mode-hydra
(use-package major-mode-hydra
  :bind
  ("C-SPC" . major-mode-hydra)
  :config
  (setq major-mode-hydra-invisible-quit-key "q"
        major-mode-hydra-title-generator #'jc-major-mode-hydra-title-generator))

(major-mode-hydra-define emacs-lisp-mode nil
  ("Eval"
   (("b" eval-buffer "buffer")
    ("d" eval-defun "defun")
    ("e" eval-last-sexp "sexp")
    ("r" eval-region "region"))
   "REPL"
   (("I" ielm "ielm"))
   "Test"
   (("t" ert "prompt")
    ("T" (ert t) "all")
    ("F" (ert :failed) "failed"))
   "Doc"
   (("d" describe-foo-at-point "thing-at-pt")
    ("f" describe-function "function")
    ("v" describe-variable "variable")
    ("i" info-lookup-symbol "info lookup"))))
#+end_src

** Org-ol-tree
Org-ol-tree provides a side-buffer outline while in org mode.
I think it uses treemacs as its underlying package.
#+begin_src elisp :tangle no :noweb-ref p-org-ol-tree
(package! org-ol-tree
  :recipe (:host github :repo "Townk/org-ol-tree"))
#+end_src

A convenient keybinding.
#+begin_src elisp :tangle no :noweb-ref org-ol-tree
(use-package! org-ol-tree
  :commands org-ol-tree
  :init
  (map! :map org-mode-map
        :after org
        :localleader
        :desc "Outline" "O" #'org-ol-tree))
#+end_src

** Org-roam-desktop
Org-roam-desktop is meant to "emulate" the step of the Zettelkasten method where you take a cluster of notes and spread them on a desktop.
This gives you a visual overview of the notes in that topic cluster, and it makes it easy to arrange them, see new connections, etc.
#+begin_src elisp :tangle no :noweb-ref p-org-roam-desktop
(package! org-roam-desktop
  :recipe (:host github :repo "jgru/org-roam-desktop"))
#+end_src

This package creates a file for the desktop, and it can only add org-roam nodes.
When it adds a node to the desktop, it transcludes the content of the node.
#+begin_src elisp :tangle no :noweb-ref org-roam-desktop
(use-package! org-roam-desktop
  :after org
  :init
  (map! "C-c n d" #'org-roam-desktop
        "C-c n a" #'org-roam-desktop-node-add)
  :config
  (setq org-roam-desktop-basename   "*OR-Desk--"
        org-roam-desktop-directory  "~/Documents/org/digital-garden/org"))
#+end_src

** Org-transclusion
Org-transclusions gives you the ability to transclude text from one note into another.
It can make it easy to include quotations in a document without retyping them.
I also think you can use a certain function to edit the transcluded text and have it change in the original document.
And maybe the transcluded text changes when you edit the original document, but I'm not sure.
I'll need to test!
#+begin_src elisp :tangle no :noweb-ref p-org-transclusion
(package! org-transclusion)
#+end_src

This is the default configuration suggested by the package.
When I start using this package more, I'll change the keybindings.
#+begin_src elisp :tangle no :noweb-ref org-transclusion
(use-package! org-transclusion
  :commands org-transclusion-mode
  :init
  (map! :after org :map org-mode-map
        "<f12>" #'org-transclusion-mode))
#+end_src

** Rotate
With this, you can rotate window layouts.
#+begin_src elisp :tangle no :noweb-ref p-rotate
(package! rotate)
#+end_src

** Zetteldesk
Zetteldesk, like org-roam-desktop, emulates spreading your cluster of notes on a desktop surface to arrange and whatnot.
It differs from org-roam-desktop in a few ways.
First, it creates a buffer instead of a document for the desktop, but you can always save that.
Two, it's not limited to org-roam nodes.
You can also add info pages, buffers, other org files, and PDFs into the desktop.
#+begin_src elisp :tangle no :noweb-ref p-zetteldesk
(package! zetteldesk
  :recipe (:host github :repo "Vidianos-Giannitsis/zetteldesk.el"))
#+end_src

This is the configuration I created as the suggested one for Doom users of the package.
Chiefly, this configuration uses the hydra keybindings.
I also made a mega configuration with other keybinding suggestions.
You can view it on the repo's [[https://github.com/Vidianos-Giannitsis/zetteldesk.el/wiki/Doom-Configuration][Wiki]].
#+begin_src elisp :tangle no :noweb-ref zetteldesk
(use-package! zetteldesk
  :after org-roam
  :config
  (setq zetteldesk-hydra-prefix (kbd "C-c z"))
  (zetteldesk-mode)
  (require 'zetteldesk-kb))
#+end_src

* Documents
** =config.el=
#+begin_src elisp :noweb yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets. It is optional.
<<personal-info>>

;; Doom exposes five (optional) variables for controlling fonts in Doom:
;;
;; - `doom-font' -- the primary font to use
;; - `doom-variable-pitch-font' -- a non-monospace font (where applicable)
;; - `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;; - `doom-unicode-font' -- for unicode glyphs
;; - `doom-serif-font' -- for the `fixed-pitch-serif' face
;;
;; See 'C-h v doom-font' for documentation and more examples of what they
;; accept. For example:
;;
<<fonts>>
;;
;; If you or Emacs can't find your font, use 'M-x describe-font' to look them
;; up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to
;; refresh your font settings. If Emacs still can't find your font, it likely
;; wasn't installed correctly. Font issues are rarely Doom issues!

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;;(setq doom-theme 'doom-one)
<<theme>>

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
<<line-num>>

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
<<org-dirs>>


;; Whenever you reconfigure a package, make sure to wrap your config in an
;; `after!' block, otherwise Doom's defaults may override your settings. E.g.
;;
;;   (after! PACKAGE
;;     (setq x y))
;;
;; The exceptions to this rule:
;;
;;   - Setting file/directory variables (like `org-directory')
;;   - Setting variables which explicitly tell you to set them before their
;;     package is loaded (see 'C-h v VARIABLE' to look up their documentation).
;;   - Setting doom variables (which start with 'doom-' or '+').
;;
;; Here are some additional functions/macros that will help you configure Doom.
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;; Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
;; etc).
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

<<simple-settings>>

<<frame-sizing>>

<<doom>>

<<citar>>

<<company>>

<<doct>>

<<modeline>>

<<evil>>

<<hydra-posframe>>

<<info-colors>>

<<major-mode-hydra>>

<<mixed-pitch>>

<<org>>

<<org-appear>>

<<org-ol-tree>>

<<org-roam-desktop>>

<<org-transclusion>>

<<zetteldesk>>
#+end_src

** =packages.el=
#+begin_src elisp :tangle packages.el :noweb yes
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;(package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;(package! another-package
;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;(package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;(package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;(unpin! pinned-package)
;; ...or multiple packages
;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;(unpin! t)

<<p-consult-org-roam>>
<<p-doct>>
<<p-hydra-posframe>>
<<p-info-colors>>
<<p-major-mode-hydra>>
<<p-org-ol-tree>>
<<p-org-roam-desktop>>
<<p-org-transclusion>>
<<p-rotate>>
<<p-zetteldesk>>
#+end_src

** Autoloads
*** =hydras.el=
#+begin_src elisp :tangle autoload/hydras.el :noweb yes
;;; autoload/hydra-posframe.el -*- lexical-binding: t; -*-

;;;###autoload
<<describe-foo-at-point>>

;;;###autoload
<<jc-major-mode-hydra-title-generator>>
#+end_src

*** =icons.el=
#+begin_src elisp :tangle autoload/icons.el
;;; autoload/icons.el -*- lexical-binding: t; -*-

;;;###autoload
(defun with-faicon (icon str &optional height v-adjust)
  (s-concat (all-the-icons-faicon icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

;;;###autoload
(defun with-fileicon (icon str &optional height v-adjust)
  (s-concat (all-the-icons-fileicon icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

;;;###autoload
(defun with-octicon (icon str &optional height v-adjust)
  (s-concat (all-the-icons-octicon icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

;;;###autoload
(defun with-material (icon str &optional height v-adjust)
  (s-concat (all-the-icons-material icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

;;;###autoload
(defun with-mode-icon (mode str &optional height nospace face)
  (let* ((v-adjust (if (eq major-mode 'emacs-lisp-mode) 0.0 0.05))
         (args     `(:height ,(or height 1) :v-adjust ,v-adjust))
         (_         (when face
                      (lax-plist-put args :face face)))
         (icon     (apply #'all-the-icons-icon-for-mode mode args))
         (icon     (if (symbolp icon)
                       (apply #'all-the-icons-octicon "file-text" args)
                     icon)))
    (s-concat icon (if nospace "" " ") str)))
#+end_src

*** =org-capture.el=
#+begin_src elisp :tangle autoload/org-capture.el :noweb yes
;;; autoload/org-capture.el -*- lexical-binding: t; -*-

;;;###autoload
<<org-capture-select-template-prettier>>

;;;###autoload
<<org-mks-pretty>>

;;;###autoload
<<+doct-icon-declaration-to-icon>>

;;;###autoload
<<+doct-iconify-capture-templates>>
#+end_src

*** =org-roam.el=
#+begin_src elisp :tangle autoload/org-roam.el :noweb yes
;;; autoload/org-roam.el -*- lexical-binding: t; -*-

;;;###autoload
<<node-from-cite>>

;;;###autoload
<<new-node-as-draft>>
#+end_src

*** =posframe.el=
#+begin_src elisp :tangle autoload/posframe.el :noweb yes
;;; autoload/posframe.el -*- lexical-binding: t; -*-

;;;###autoload
<<jc-frame-bottom-poshandler>>
#+end_src
