config.el

(use-package! org-ol-tree
  :commands org-ol-tree
  :init
  (map! :map org-mode-map
        :after org
        :localleader
        :desc "Outline" "O" #'org-ol-tree))

(use-package! org-roam-desktop
  :after org
  :init
  (map! "C-c n d" #'org-roam-desktop
        "C-c n a" #'org-roam-desktop-node-add)
  :config
  (setq org-roam-desktop-basename   "*OR-Desk--"
        org-roam-desktop-directory  "~/Documents/org/digital-garden/org"))

(use-package! org-transclusion
  :commands org-transclusion-mode
  :init
  (map! :after org :map org-mode-map
        "<f12>" #'org-transclusion-mode))

(use-package! zetteldesk
  :after org-roam
  :config
  (setq zetteldesk-hydra-prefix (kbd "C-c z"))
  (zetteldesk-mode)
  (require 'zetteldesk-kb))
